/*Дано дійсні числа x та  y. 
Обчислити f=(x^2+y^2)/√(x+y)*/

#include <stdio.h> //Підключення бібліотек
#include <math.h>

int main() {
    float x, y, f; //Задаємо змінні
    
    printf("Введіть значення x: "); //Задання значень х
    scanf("%lf", &x);
    
    printf("Введіть значення y: "); //Задання значень у
    scanf("%lf", &y);
    
    if (x + y <= 0) { //перевірка, якщо х+у менше нуля функція не можлива так як це знаменник
        printf("Помилка: Знаменник не може бути мінусовим або нульовим.\n"); //Повідомляємо про помилку
    } else { //якщо х+у більше нуля, функція буде дійсною та обчислиться
        f = (pow(x, 2) + pow(y, 2)) / sqrt(x + y);
        printf("Результат: %.2lf\n", f); //виводимо результат 
    }
    
    return 0; //завершення програми
}